artillery/files.yml
config:
  target: "http://haproxy"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Trafico en tiempo real de Drive"

scenarios:
  - name: "Descarga de archivos (Directo de Nginx)"
    weight: 8
    flow:
      - get:
          url: "http://192.168.65.20/files/test.txt"

  - name: "Subida de archivos (Vía HAProxy a Flask)"
    weight: 2
    flow:
      - post:
          url: "/upload"
          formData:
            file:
              fromFile: "./test.txt"